// Условное ветвление: if, '?'
// Задачи

// Используя конструкцию if..else, напишите код, который будет спрашивать: „Какое «официальное» название JavaScript?“
// Если пользователь вводит «ECMAScript», то показать: «Верно!», в противном случае – отобразить: «Не знаете? ECMAScript!»

// const officialName = prompt("Какое «официальное» название JavaScript?" , "");

// if (officialName === "ECMAScript"){
//     alert ("Верно")
// }else{
//     alert ("Неверно, ECMAScript")
// }

// Используя конструкцию if..else, напишите код, который получает число через prompt, а затем выводит в alert:

// 1, если значение больше нуля,
// -1, если значение меньше нуля,
// 0, если значение равно нулю.
// Предполагается, что пользователь вводит только числа.

// const value = prompt ("Введите число", 0);

// if (value > 0){
//     alert(1)
// }else if (value < 0){
//     alert(-1)
// }else{
//     alert(0)
// }

// Перепишите конструкцию if с использованием условного оператора '?':

// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }

// let result = (a + b < 4) ? "Мало" : "Много"


